"The Unarchiver/Unarchive To Current Folder" = "The Unarchiver/Décompresser dans le dossier courant";

"The Unarchiver/Unarchive To Desktop" = "The Unarchiver/Décompresser sur le bureau";

"The Unarchiver/Unarchive To..." = "The Unarchiver/Décompresser dans…";
